test/fixtures/gocardless/sync/multipleInactiveSubscriptionsWithSameEmail.json

{
  "customers": [
    {
      "id": "CUE23963083513",
      "created_at": "2015-11-25T06:26:21.823Z",
      "email": "976BEAC50C85@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    },
    {
      "id": "CU2B69A2C121AE",
      "created_at": "2016-03-22T21:24:18.565Z",
      "email": "976BEAC50C85@test.com",
      "given_name": "Test",
      "family_name": "Test",
      "company_name": "",
      "address_line1": "Test",
      "address_line2": "Test",
      "address_line3": "",
      "city": "Test",
      "region": "",
      "postal_code": "BS1 1AA",
      "country_code": "GB",
      "language": "en",
      "swedish_identity_number": null,
      "danish_identity_number": null,
      "metadata": {}
    }
  ],
  "mandates": [
    {
      "id": "MD20E3F6B0677B",
      "created_at": "2015-11-25T06:26:22.138Z",
      "reference": "F04DB2BCA2ED",
      "status": "cancelled",
      "scheme": "bacs",
      "next_possible_charge_date": "Invalid date",
      "payments_require_approval": false,
      "metadata": {},
      "links": {
        "customer_bank_account": "BA884CBBB442AB",
        "creditor": "CRD56BAA7CB001",
        "customer": "CUE23963083513"
      }
    },
    {
      "id": "MDF6FA2CF556BB",
      "created_at": "2016-03-22T21:24:18.789Z",
      "reference": "051DBBC01DB2",
      "status": "cancelled",
      "scheme": "bacs",
      "next_possible_charge_date": "Invalid date",
      "payments_require_approval": false,
      "metadata": {},
      "links": {
        "customer_bank_account": "BA4182C33F3BC1",
        "creditor": "CRD56BAA7CB001",
        "customer": "CU2B69A2C121AE"
      }
    }
  ],
  "subscriptions": [
    {
      "id": "SB5C6AF081B3D8",
      "created_at": "2015-11-25T06:26:25.000Z",
      "amount": 200,
      "currency": "GBP",
      "status": "cancelled",
      "name": "Membership- £2",
      "start_date": "2015-11-29",
      "end_date": null,
      "interval": 1,
      "interval_unit": "monthly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [],
      "app_fee": null,
      "links": {
        "mandate": "MD20E3F6B0677B"
      }
    },
    {
      "id": "SBA6F69719AD23",
      "created_at": "2016-03-22T21:24:19.000Z",
      "amount": 200,
      "currency": "GBP",
      "status": "cancelled",
      "name": "Membership- £2",
      "start_date": "2016-03-29",
      "end_date": null,
      "interval": 1,
      "interval_unit": "monthly",
      "day_of_month": null,
      "month": null,
      "metadata": {},
      "payment_reference": null,
      "upcoming_payments": [],
      "app_fee": null,
      "links": {
        "mandate": "MDF6FA2CF556BB"
      }
    }
  ],
  "payments": [
    {
      "id": "PM9CB23A67CA48",
      "created_at": "2016-02-23T16:12:51.482Z",
      "charge_date": "2016-02-28",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MD20E3F6B0677B",
        "subscription": "SB5C6AF081B3D8"
      }
    },
    {
      "id": "PM0F2065200D06",
      "created_at": "2016-01-25T18:06:16.230Z",
      "charge_date": "2016-01-30",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MD20E3F6B0677B",
        "subscription": "SB5C6AF081B3D8"
      }
    },
    {
      "id": "PM9071A61CFBC3",
      "created_at": "2015-12-26T22:26:22.450Z",
      "charge_date": "2016-01-01",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MD20E3F6B0677B",
        "subscription": "SB5C6AF081B3D8"
      }
    },
    {
      "id": "PM12DD837FD22B",
      "created_at": "2015-11-25T06:26:25.158Z",
      "charge_date": "2015-12-01",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MD20E3F6B0677B",
        "subscription": "SB5C6AF081B3D8"
      }
    },
    {
      "id": "PM22990FD956D4",
      "created_at": "2018-02-23T17:02:16.899Z",
      "charge_date": "2018-02-26",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PMD6F1C67CBE60",
      "created_at": "2018-01-26T16:18:26.797Z",
      "charge_date": "2018-01-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM19E8F0F55B51",
      "created_at": "2017-12-24T16:27:50.761Z",
      "charge_date": "2017-12-30",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PMEC33974B76EF",
      "created_at": "2017-11-25T16:31:55.481Z",
      "charge_date": "2017-11-28",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM5D430DDF4422",
      "created_at": "2017-10-24T15:08:24.575Z",
      "charge_date": "2017-10-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM2B855F7AE5C6",
      "created_at": "2017-09-24T15:22:18.001Z",
      "charge_date": "2017-09-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PMF5973D8CD036",
      "created_at": "2017-08-26T15:13:28.955Z",
      "charge_date": "2017-08-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PMF17FB850CECE",
      "created_at": "2017-07-24T15:19:55.205Z",
      "charge_date": "2017-07-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM27963CF60326",
      "created_at": "2017-06-25T15:00:01.208Z",
      "charge_date": "2017-06-30",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM12A024BDE2D8",
      "created_at": "2017-05-23T15:02:42.475Z",
      "charge_date": "2017-05-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM57C017A5821A",
      "created_at": "2017-04-23T15:09:42.287Z",
      "charge_date": "2017-04-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM9ED1781F0274",
      "created_at": "2017-03-26T15:10:40.203Z",
      "charge_date": "2017-03-31",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PMDF70212AEDE3",
      "created_at": "2017-02-21T16:02:00.514Z",
      "charge_date": "2017-02-26",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PMA302EDF6C407",
      "created_at": "2017-01-24T16:02:58.787Z",
      "charge_date": "2017-01-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PMF9D2812E6568",
      "created_at": "2016-12-25T16:10:37.943Z",
      "charge_date": "2016-12-31",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM3CEE62337F65",
      "created_at": "2016-11-25T16:07:35.479Z",
      "charge_date": "2016-11-28",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM2F5718D33B55",
      "created_at": "2016-10-24T15:08:46.602Z",
      "charge_date": "2016-10-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM7AD64F08A3AA",
      "created_at": "2016-09-25T15:16:26.930Z",
      "charge_date": "2016-09-30",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM7ACDCA2745FE",
      "created_at": "2016-08-23T15:47:18.833Z",
      "charge_date": "2016-08-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM2D1FE335FAD9",
      "created_at": "2016-07-24T15:15:32.645Z",
      "charge_date": "2016-07-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM8EF41AEEEB35",
      "created_at": "2016-06-25T15:06:01.088Z",
      "charge_date": "2016-06-28",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM598CF99FE040",
      "created_at": "2016-05-23T15:11:16.758Z",
      "charge_date": "2016-05-29",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM83C51CD44A63",
      "created_at": "2016-04-24T15:15:50.590Z",
      "charge_date": "2016-04-30",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    },
    {
      "id": "PM894818542431",
      "created_at": "2016-03-26T22:43:29.188Z",
      "charge_date": "2016-04-01",
      "amount": 200,
      "description": "Membership- £2",
      "currency": "GBP",
      "status": "paid_out",
      "amount_refunded": 0,
      "reference": null,
      "metadata": {},
      "links": {
        "mandate": "MDF6FA2CF556BB",
        "subscription": "SBA6F69719AD23"
      }
    }
  ],
  "subscriptionCancelledEvents": [
    {
      "id": "EV68C38741E5FE",
      "created_at": "2018-02-27T02:10:28.951Z",
      "resource_type": "subscriptions",
      "action": "cancelled",
      "links": {
        "subscription": "SBA6F69719AD23"
      },
      "details": {
        "origin": "api",
        "cause": "subscription_cancelled",
        "description": "The subscription has been cancelled at your request."
      },
      "metadata": {}
    }
  ]
}
